tutorials/mhdFoam/hartmann/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho             rho [1 -3 0 0 0 0 0] 1;

nu              nu [0 2 -1 0 0 0 0] 1;

mu              mu [1 1 -2 0 0 -2 0] 1;

sigma           sigma [-1 -3 3 0 0 2 0] 1;


// ************************************************************************* //
