tutorials/mhdFoam/hartmann/system/sampleDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


interpolationScheme cellPoint;

writeFormat     raw;

sampleSets      
(
    uniform 
    {
        name            centreProfile;
        axis            y;
        start           (10.001 -1 0.01);
        end             (10.001 1 0.01);
        nPoints         100;
    }
);

fields          
(
    U.component(0)
);


// ************************************************************************* //
